/*
Virtual Memory

Each VM Page is 4K/16K/64K, and will map to a location in the pagefile.
Page indices will correspond to a logical pagefile entry.
 */

// #define		TK_VMEM_PAGESHL		12
#define		TK_VMEM_PAGESHL		TKMM_PAGEBITS
#define		TK_VMEM_BLOCKSHL	9
#define		TK_VMEM_PGBLKSHL	(TK_VMEM_PAGESHL-TK_VMEM_BLOCKSHL)

// #define		TK_VMEM_PTESHL		12
#define		TK_VMEM_PTESHL		TKMM_PAGEBITS

// #define		TK_VMEM_PTEMASK		16777215
#define		TK_VMEM_PTEMASK		(16777215ULL>>(TK_VMEM_PTESHL-12))

typedef struct TK_VMem_PageInfo_s TK_VMem_PageInfo;
struct TK_VMem_PageInfo_s {
int		pidx;		//00, page index (pagefile)
byte	hi;			//04, hash index
byte	pad0;		//05, pad
u16		flags;		//06, flags
s32		next;		//08, next in LRU
s32		prev;		//0C, prev in LRU
u32		vapidx;		//10, virtual address page index
s32		hnext;		//14, next in hash
s32		hprev;		//18, prev in hash
u16		pgchk;		//1C, page checksum
u16		pad3;		//1E, pad
//20
u64		vaphi;		//20, high bits of address
u64		pad4;		//28
u64		pad5;		//30
u64		pad6;		//38
//40
};

#ifdef __BJX2__

extern volatile u64 __arch_ttb;
extern volatile u64 __arch_tea;
extern volatile u64 __arch_exsr;
extern volatile u64 __arch_mmcr;
extern volatile u64 __arch_sttb;
extern volatile u64 __arch_krr;
extern volatile u64 __arch_tbr;

extern volatile u64 __arch_pch;
extern volatile u64 __arch_gbh;

extern volatile void *__arch_isrsave;		/* Pseudo */

#endif

int tk_syscall_utxt(void *sobj, int umsg, void *pptr, void *args);
int tk_syscall_rv_utxt(void *sobj, int umsg, void *pptr, void *args);


/* Model TLB so we can check if a page is likely already evicted.
 * The need for this is not an ideal turn of events.
 * This is needed to avoid unneeded TLB VADDR flushes, which
 * carry a risk of getting stuck in infinite TLB miss loops.
 */
u32 tk_vmem_faketlb_vpn[256*4];
u32 tk_vmem_faketlb_ppn[256*4];

byte tk_vmem_faketlb_pix[256*8];

u64 tk_vmem_tlbmisshist[256];
byte tk_vmem_tlbmisshrov;
byte tk_vmem_tlbflushinhibit;



